---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoops
source: html/e07dca8d-ff06-312f-333e-102201f78ef0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoops Property

Sketch is empty.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoLoops { get; }
```